"""
Выведите из файла character.json Имя персонажа,родную планету и список эпизодов в которых он появлялся.
"""
import jsonjson
with open('character.json') as f:
    json = json.load(f)
planet = planet.get("origin")
print(data.get("name",))
print(planet["name"])
print(data.get("episode"))task2
